// Користувач може оформити доставку товару до себе в країну, 
// вказавши її при відвідуванні сторінки в prompt. 
// Врахуй, користувач може ввести ім'я країни не тільки буквами 
// нижнього регістра, а наприклад 'кИтАЙ'.

// Напиши скрипт який виводить повідомлення про вартість доставки в зазначену країну. 
// Обов'язково використовуй switch. Формат повідомлення:
//  'Доставка в [країна] буде коштувати [ціна] кредитів'.

// Але доставка є не скрізь, якщо зазначеної країни немає в списку,
//  то виводь в alert повідомлення 'У вашій країні доставка недоступна'.

// Нижче наведено список країн і вартість доставки.

// Китай - 100 кредитів
// Чилі - 250 кредитів
// Австралія - 170 кредитів
// Індія - 80 кредитів
// Ямайка - 120 кредитів

let userCountry = prompt('Вкажіть Вашу країну для доставки')
let price
if (userCountry!==null){
    if(isNaN(userCountry)){
    switch (userCountry.toLowerCase()) {
            case 'китай':
                price=100
                alert(`Доставка в ${userCountry} буде коштувати ${price} кредитів`)
                break;
            case 'чилі':
                price=250
                alert(`Доставка в ${userCountry} буде коштувати ${price} кредитів`)
                break;
            case 'австралія':
                price=170
                alert(`Доставка в ${userCountry} буде коштувати ${price} кредитів`)
                break;
            case 'індія':
                price=80
                alert(`Доставка в ${userCountry} буде коштувати ${price} кредитів`)
                break;
            case 'ямайка':
                price=120
                alert(`Доставка в ${userCountry} буде коштувати ${price} кредитів`)
                break;
            
            default:
                alert('У вашій країні доставка недоступна')
                break;
}} else{alert('Ви ввели число')}
}else { alert('Скасовано користувачем')}